# -*- coding: utf-8 -*-
'''
    Это НОВЫЙ шаблон скрипта.
    Если чекбокс отмечен, то скрипт будет сохранен
    и привязан к событию.

    Если не хотите сохранять новый скрипт, то
    просто уберите галочку с чекбокса

    РЕКОМЕНДУЕТСЯ УДАЛИТЬ ЭТОТ КОММЕНТАРИЙ
    ЕСЛИ ВЫ СОБИРАЕТЕСТЬ СОХРАНИТЬ СКРИПТ
'''

def execute(args):
    '''

    :param args: кортеж входных параметров,
            args[0] == ссылка на класс шаблонной логики
    :return: Возвращает текстовый ответ в конце сценария
    '''
    tempLogic = args[0]